Repository: WebDevStudios/BuddyPress-Registration-Options
Catalog: languages/bp-registration-options-*.po
Languages: ca, he_il, ru_ru

source: GDPR compliance: Check this to remove IP addresses previously saved IP user meta on approved users.
ru_ru: GDPR совместимость (отметьте для удаления IP-адресов ранее сохраненных в метаданных для одобренных пользователей).

source: You have pending users to moderate.
ru_ru: У вас есть ожидающие одобрения регистрации пользователи.

source: Pending Membership
ru_ru: Ожидает одобрения регистрации

source: Follow on Twitter:
ru_ru: Подписаться в Twitter:

source: Please Report Bugs
ru_ru: Пожалуйста, сообщайте об ошибках

source: %s version %s by %s
ru_ru: %s версия %s от %s

source: Pagination:
ru_ru: Постраничная навигация:

source: Short Code Key: [username], [user_email]
ru_ru: Вы можете использовать шорткоды: [username], [user_email]

source: User Pending Email Message:
ru_ru: Сообщение ожидающему одобрения пользователю:

source: Admin Pending Email Message:
ru_ru: Сообщение администратору об ожидающих пользователях:

source: Add new user notification to admin user account BuddyPress notification inbox.
ru_ru: Добавить уведомление о новых пользователях во входящие уведомления администратора BuddyPress.

source: Hi [username], your account at %s is currently pending approval.
ru_ru: Привет, [username], ваша учетная запись на %s ожидает одобрения.

source: [username] ( [user_email] ) would like to become a member of your website. To accept or reject their request, please go to %s
ru_ru: [username] ( [user_email] ) хочет зарегистрироваться на вашем сайте, для одобрения или отклонения этого запроса перейдите на %s.

source: Please %s to take action
ru_ru: Пожалуйста, %s для совершения действия.

source: You have %d new member request that needs to be approved or denied.
ru_ru: У вас %d новый запрос регистрации пользователей для одобрения или отклонения.

source: City: %s
ru_ru: Город: %s

source: This BuddyPress extension allows you to enable user moderation for new members, as well as help create a private network for your users. If moderation is enabled, any new members will be denied access to your BuddyPress and bbPress areas on your site, with the exception of their own user profile. They will be allowed to edit and configure that much. They will also not be listed in the members lists on the frontend until approved. Custom messages are available so you can tailor them to the tone of your website and community. When an admin approves or denies a user, email notifications will be sent to let them know of the decision.
ru_ru: Это расширение BuddyPress позволяет вам включать модерацию регистрации пользователей, а также помогает создавать частные сети для ваших пользователей. Если модерация включена, всем новым участникам будет отказано в доступе к областям BuddyPress и bbPress на вашем сайте, за исключением их собственного профиля пользователя. Им будет разрешено редактировать и настраивать только его. Они также не будут перечислены в списках участников на веб-интерфейсе, пока не будут утверждены. Пользовательские сообщения настраиваются, так, что вы можете адаптировать их для вашего сайта и сообщества. Когда администратор одобряет или отклоняет пользователя, по электронной почте будут отправляться уведомления, чтобы сообщить им о решении.

source: New Member Request
ca: Nova sol·licitud d'afiliació
he_il: בקשת חברות חדשה
ru_ru: Заявка от нового пользователя

source: %s ( %s ) would like to become a member of your website. To accept or reject their request, please go to <a href="%s">%s</a>.
ca: %s ( %s ) li agradaria convertir-se en un membre del vostre web. Per acceptar o rebutjar la seva sol·licitud d'afiliació, si us plau aneu a <a href="%s">%s</a>.
he_il: %s ( %s ) רוצה להתחבר לאתר האינטרנט שלך. כדי לקבל או לדחות את בקשתם נא להמשיך בלינק הבא <a href="%s">%s</a>
ru_ru: %s (%s) хочет зарегистрироваться на вашем сайте, для одобрения или отклонения этого запроса перейдите на <a href="%s">%s</a>.

source: Are you sure you want to reset to the default messages?
ca: Esteu segur que voleu restablir els missatges per defecte?
he_il: האם אתה בטוח שאתה רוצה לאפס תוסף זה להודעות ברירת המחדל?
ru_ru: Уверены. что хотите сбросить сообщение на по умолчанию?

source: Are you sure you want to ban and delete the checked member(s)?
ca: Esteu segur que voleu prohibir i esborrar el(s) membre (s) sel·leccionats?
he_il: האם אתה בטוח שאתה רוצה לאסור ולמחוק את החברים שנבדקו?
ru_ru: Вы уверены, что хотите забанить и удалить выбранного(ых) пользователя(ей)?

source: Are you sure you want to deny and delete the checked member(s)?
ca: Esteu segur que voleu denegar i esborrar el(s) membre (s) sel·leccionats?
he_il: האם אתה בטוח שאתה רוצה לדחות ולמחוק את החברים שנבדקו?
ru_ru: Вы уверены, что хотите запретить и удалить выбранного(ых) пользователя(ей)?

source: You have no blocked IP Addresses or Email Addresses at the moment
ca: Actualment no teniu bloquejades adreces IP o adreces de correu electrònic
he_il: כרגע אין לך כתובות IP או כתובות דואר אלקטרוני חסומות
ru_ru: У вас на данный момент нет заблокированных IP или email адресов.

source: Email Address
ca: Correu electrònic
he_il: כתובת דוא"ל
ru_ru: E-mail

source: The following Email addresses are currently banned.
ca: Actualment, les següents adreces de correu electrònic estan prohibides.
he_il: כתובות דוא"ל הבאות כרגע אסרו.
ru_ru: Эти адреса эл.почты в настоящее время запрещены.

source: IP Address
ca: Adreça IP
he_il: כתובת ה - IP
ru_ru: IP-адрес

source: The following IP addresses are currently banned.
ca: Actualment, les següents adreces IP estan prohibides.
he_il: כתובות IP הבאות כרגע אסרו.
ru_ru: Эти IP-адреса в настоящее время запрещены.

source: No new members to approve.
ca: No hi ha nous membres per a aprovar.
he_il: אין חברים חדשים לאישור.
ru_ru: Нет пользователей для проверки.

source: Deny
ca: Denegar
he_il: דחה
ru_ru: Отвергнуть

source: Approve
ca: Aprovar
he_il: אשר
ru_ru: Подтвердить

source: Additional Data
ca: Dades addicionals
he_il: נתונים נוספים
ru_ru: Доп. информация

source: Created
ca: Creat
he_il: נוצר
ru_ru: Создан

source: Email
ca: Correu electrònic
he_il: דוא''ל
ru_ru: Эл. почта

source: Name
ca: Nom
he_il: שם
ru_ru: Наименование

source: Photo
ca: Foto
he_il: צילום
ru_ru: Фотография

source: Please approve or deny the following new members:
ca: Si us plau, aproveu o denegueu l'afiliació dels següents nous membres:
he_il: אנא לאשר או לדחות את החברים החדשים הבאים:
ru_ru: Разрешите или запретите доступ следующим новым пользователям:

source: Save Options
ca: Desa els canvis
he_il: שמירת הגדרות
ru_ru: Параметры сохранения

source: Reset Messages
ca: Restablir missatges
he_il: הודעות איפוס
ru_ru: Сбросить сообщения

source: Account Denied Email:
ca: Correu de denegació del compte:
he_il: דואר אלקטרוני לחשבון אשר נדחה:
ru_ru: Аккаунт заблокирован (сообщение по email):

source: Account Approved Email:
ca: Correu d'aprovació del compte:
he_il: דואר אלקטרוני לחשבון אשר אושר:
ru_ru: Аккаунт одобрен (сообщение по email):

source: Activate & Profile Alert Message:
ca: Activació i missatge d'alerta al perfil:
he_il: הפעל ובדוק הודעת התראה:
ru_ru: Предупредительное сообщение <br> о правилах активации аккаунта:

source: Only registered or approved members can view BuddyPress/bbPress pages (Private Network).
ca: Només els usuaris registrats o autoritzats poden veure les pgines BuddyPress/bbPress (xarxa privada).
he_il: רק חברים רשומים או אשר אושרו יכולים לראות דפי BuddyPress / bbPress (רשת פרטית).
ru_ru: Только зарегистрированные или одобренные участники могут просматривать страницы BuddyPress/bbPress pages (частная сеть).

source: Every new member will have to be approved by an administrator before they can interact with BuddyPress/bbPress components.
ca: Cada nou membre haur de ser aprovat per un administrador abans que puguin interactuar amb els components BuddyPress/bbPress.
he_il: כל חשבון חבר חדש יצטרך להיות מאושר על ידי מנהל מערכת לפני שהם יוכלו לקיים אינטראקציה עם רכיבי BuddyPress / bbPress.
ru_ru: Каждый новый пользователь должен быть одобрен администратором, перед тем как они смогут использовать BuddyPress/bbPress компоненты.

source: Moderate New Members
ca: Moderar als membres nous
he_il: טיפול בחברים חדשים
ru_ru: Проверять всех новых пользователей

source: Hi [username], we regret to inform you that your member account at %s has been denied...
ru_ru: Приветствую, [username]. С сожалением сообщаю вам, что ваш аккаунт на сайте %s был отклонен...

source: Hi [username], your member account at %s has been approved! You can now login and start interacting with the rest of the community...
ru_ru: Приветствую, [username]. Ваш новый аккаунт на сайте %s был одобрен! Теперь вы можете авторизоваться на сайте и общаться со всеми ...

source: Your membership account is awaiting approval by the site administrator. You will not be able to fully interact with the social aspects of this website until your account is approved. Once approved or denied you will receive an email notice.
ca: El vostre compte est pendent d'aprovació per part de l'AMPA. Mentrestant la interacció amb la intranet est limitada al vostre perfil. Rebreu una notificació per correu electrònic en breu.
he_il: חשבון החברות שלך ממתין לאישור על-ידי מנהל האתר. אתה לא יהיה מסוגל לתקשר באופן מלא עם המערכות של אתר זה עד שהחשבון שלך לא יאושר. ברגע שיאושר (או לא) תקבל הודעת דואר אלקטרוני.
ru_ru: Ваша учетная запись ожидает проверки администратором сайта. Вы не сможете воспользоваться всеми возможностями этого сайта до тех пор, пока ваш аккаунт не будет проверен. После проверки и положительного/отрицательного решения вы получите уведомление по почте.

source: Member Requests
ca: Sol·licituts d'afiliació
he_il: בקשות חברות
ru_ru: Запросы пользователей

source: General Settings
ca: Parmetres generals
he_il: הגדרות כלליות
ru_ru: Общие Настройки

source: BP Registration Options
he_il: אופציות הרשמה BP
ru_ru: Настройки регистрации BP

source: Member Requests
ca: Sol·licituts d'afiliació
he_il: בקשות חברות
ru_ru: Запросы пользователей

source: BP Registration
he_il: רישום BP
ru_ru: Регистрация BP

source: click here
ca: clic aquí
he_il: להקליק כאן
ru_ru: нажмите здесь

source: Membership Approved
ca: Afiliació aprovada
he_il: בקשת חברות מאושרות
ru_ru: Членство одобрено

source: Membership Denied
ca: Afiliació denegada
he_il: בקשת חברות נדחתה
ru_ru: Членство отклонено

source: This plugin requires WordPress version 3.0 or higher.
ca: Aquesta extensió de WordPress requereix la versió 3.0 o superior.
he_il: תוסף זה דורש גרסה וורדפרס 3.0 או חדשה יותר.
ru_ru: Плагину необходим WordPress версии 3.0 или выше
